'''

Задача: 2. Намерете средната цена на продукт от текстови файл

Свалете тези два файла (catalog_sample.csv) и (catalog_full.csv)
Файловете са реален продуктов каталог на известен производител на спортни стоки,
с описание и цени (цените са произволни), като разликата между двата файла е в
броя на артикулите. catalog_sample има само 200 артикула, докато catalog_full има
над 60000. Структурата на двата файла е еднаква.

catalog_sample.csv
catalog_full.csv

Напишете програма, която намира средната цена от всички артикули във файла.

Структурата на CSV файловете е следната:

    - каталожен номер
    - име на продукта
    - цветове на продукта. Ако са повече от един са разделени с /
    - за какъв вид активност е предназначен артикула
    - каква е групата на артикула
    - за кой пол и възраст е предназначен артикула
    - цена

Разделителят на данните е , (запетая), а десетичният знак е . (точка)

'''


# with open('catalog_sample.csv') as f:
with open('catalog_full.csv') as f:
    count = 0
    products_sum = 0
    for line in f:
        count += 1
        try:
            products_sum += float(line[line.rindex(',') + 1:-1])
        except ValueError as e:
            print('ValueError: ', e.args)

if count > 0:
    print('Средна цена на продукт: {:.2f}'.format(products_sum / count))
else:
    print('Няма намерени продукти с валидна цена.')
