'''

Задача: 3. Инициали

По въведени имена с input() искаме програмата да покаже как това име ще се съкрати до инициали.

Пример как трябва да изглежда програмата:

Въведете име:  Борис Червенков
    Инициали: Б.Ч.

Правилата:

    - От всяка част от името трябва да остане по една буква, след което да има точка;
      например ако въведем 3 или повече имена - Име Презиме Фамилия, програмата трябва да покаже И.П.Ф.;
    - Програмата трябва да може да работи на кирилица и на латиницa - John Lawrence Smith -> J.L.S.;

За по-смелите (незадължително):

    - титлите 'доктор', 'д-р.', 'проф.' и т.н. не трябва да участват в инициалите,
      напр. проф. Кирил Господинов -> К.Г.

    - западно-европейците понякога имат части от имената, които също не бива да участват в инициалите,
      напр. холандското 'van' в Guido van Rossum -> G.R. , и германското 'von' - Wernher von Braun -> W.B.;

'''

name = input('Въведете име: ')
print('Инициали: ', end='')

# for str1 in name.split():
#     if str1[0].isupper():
#         print(str1[0] + '.', end='')

initials = [str1[0] for str1 in name.split() if str1[0].isupper()]

if len(initials) > 0:
    print('{0}.'.format('.'.join(map(str, initials))))
