'''

Задача: 4. Средна цена, както се прави в белите държави

Вие сте служител в агенцията по лекарствата, и ви е поставена задачата да
разберете каква е реалната цена на лекарството Непукин (известно още като Заебин),
за да може да знаете колко са адекватни цените в офертите на фирмите в България.
Вие трябва да съберете референтни цени на това лекарство от различни източници и
да пресметнете средната цена. За да бъде стойността максимално близка до реалната,
от всички събрани цени трябва да премахните най-ниската и най-високата цена,
след което да пресметнете средната стойност от останалите.

Въвеждането на цените се извършва от конзола като всеки "нов ред" е една цена.
Данните може да бъдат взимани с input(). Спирането на въвеждането на цени става
когато в конзолата напишете думата stop, след което програмата трябва да покаже
най-ниската цена, най-високата цена и средната цена от останалите записи. За да
може да работи програмата правилно, трябва да се въведат минимум 4 цени.

Помислете за крайните случаи като:

    - всички цени са еднакви - тогава няма най-ниска или най-висока
    - има 2 или повече еднакви най-ниски/най-високи цени
    - след премахване на най-ниска и най-висока цена не остават никакви цени

'''

prices = []
while True:
    str_in = input('Въведи цена за 1 опаковка Заебин: ')
    if str_in == 'stop':
        break

    try:
        price = float(str_in)
        if price <= 0:
            raise ValueError('Грешно въведена цена! Цената трябва да е положително число!')
        prices.append(price)

    except ValueError as err:
        print(err.args[0])

if len(prices) < 4:
    print('За да работи програмата правилно, трябва да въведете минимум 4 цени!')
else:
    min_price = min(prices)
    max_price = max(prices)
    avg_price = 0
    if min_price == max_price:
        avg_price = min_price
    else:
        while len(prices) >= 4 and max_price in prices:
            prices.remove(max_price)

        while len(prices) >= 3 and min_price in prices:
            prices.remove(min_price)

        avg_price = sum(prices)/len(prices)

    print(' Най-ниска цена за 1 опаковка Заебин: {}'.format(min_price))
    print('Най-висока цена за 1 опаковка Заебин: {}'.format(max_price))
    print('    Средна цена за 1 опаковка Заебин: {}'.format(avg_price))
